[rule]
description = """
Identifies unusual processes connecting to domains using known free SSL certificates. Adversaries may employ free HTTP
SSL certificates to conceal command and control traffic.
"""
id = "88f6c3d4-112e-4fad-b3ef-33095c954b63"
license = "Elastic License v2"
name = "Suspicious DNS Query to Free SSL Certificate Domains"
os_list = ["windows"]
version = "1.0.4"

query = '''
sequence by process.entity_id with maxspan=5m
 [process where event.action == "start" and
  (
   process.Ext.device.product_id : ("Virtual DVD-ROM", "Virtual Disk", "USB *") or
   process.executable :
         ("?:\\Windows\\system32\\*",
		  "?:\\Windows\\SysWOW64\\*",
		  "?:\\Windows\\Microsoft.NET\\Framework*.exe",
		  "?:\\Windows\\explorer.exe",
		  "?:\\Windows\\notepad.exe",
		  "?:\\Windows\\Tasks\\*",
		  "?:\\Windows\\Temp\\*", 
		  "?:\\Users\\*\\AppData\\Local\\Temp\\Temp?_*", 
		  "?:\\Users\\*\\AppData\\Local\\Temp\\7z*", 
		  "?:\\Users\\*\\AppData\\Local\\Temp\\Rar*", 
		  "?:\\Users\\*\\AppData\\Local\\Temp\\BNZ.*") or 
   (process.executable : ("?:\\Users\\*", "?:\\ProgramData\\*") and process.Ext.relative_file_creation_time <= 500)
   ) and
   not process.executable :
         ("?:\\Windows\\System32\\drivers\\RivetNetworks\\Killer\\KillerNetworkService.exe",
		  "?:\\Windows\\System32\\lsass.exe",
		  "?:\\Windows\\System32\\svchost.exe",
		  "?:\\Windows\\System32\\backgroundTaskHost.exe",
		  "?:\\Windows\\SystemApps\\*.exe",
		  "?:\\Windows\\explorer.exe", 
		  "?:\\Windows\\System32\\svchost.exe", 
		  "?:\\Windows\\System32\\AppHostRegistrationVerifier.exe", 
		  "?:\\Windows\\System32\\MicrosoftEdgeCP.exe", 
		  "?:\\Windows\\System32\\inetsrv\\InetMgr.exe", 
		  "?:\\Windows\\System32\\wbem\\WmiPrvSE.exe", 
		  "?:\\Windows\\SysWOW64\\wbem\\WmiPrvSE.exe",
		  "?:\\Windows\\System32\\taskhostw.exe", 
		  "?:\\Windows\\System32\\WWAHost.exe",
		  "?:\\ProgramData\\Microsoft\\Windows Defender\\Platform\\*\\MsMpEng.exe", 
		  "?:\\ProgramData\\Microsoft\\Windows Defender\\Platform\\*\\NisSrv.exe", 
		  "?:\\Windows\\System32\\WindowsPowerShell\\v*\\powershell.exe", 
		  "?:\\Windows\\System32\\inetsrv\\w3wp.exe", 
		  "?:\\Windows\\SysWOW64\\inetsrv\\w3wp.exe",
		  "?:\\Windows\\System32\\AuthHost.exe", 
		  "?:\\Windows\\SysWOW64\\WuWUI.exe", 
		  "?:\\Windows\\System32\\msfeedssync.exe",
		  "?:\\Windows\\System32\\omadmclient.exe",
		  "?:\\Windows\\System32\\DeviceCensus.exe",
		  "?:\\Windows\\System32\\smartscreen.exe",
		  "?:\\Windows\\System32\\ipconfig.exe",
		  "?:\\Windows\\SysWOW64\\ipconfig.exe",
		  "?:\\Windows\\System32\\SIHClient.exe",
		  "?:\\Windows\\System32\\WinBioPlugIns\\FaceFodUninstaller.exe") and
   not (process.executable :
              ("?:\\Windows\\Sys*\\ping.exe",
               "?:\\Windows\\system32\\nslookup.exe") and process.args_count >= 2) and
   not (process.name : "rundll32.exe" and
         process.args : ("?:\\windows\\system32\\davclnt.dll,DavSetCookie", 
	                 "?:\\Windows\\SysWOW64\\davclnt.dll,DavSetCookie", 
			 "cryptext.dll,CryptExtOpenCER", 
			 "cryptext.dll,CryptExtAddCER", 
			 "?:\\Windows\\system32\\cryptext.dll,CryptExt*")) and 
   not (process.executable : ("?:\\Users\\*", "?:\\ProgramData\\*") and process.code_signature.trusted == true) and 
   not (process.pe.original_file_name : "NetworkOnboardingClient.dll" and process.code_signature.trusted == true) and 
   not process.hash.sha256 : 
               ("edd0a64dc65087ffe453ca94b267169b39458a983b29ac31320fcaa983d0f97e",
                "316fbec9eca41deef9a63837dfaf4de4369ca507c5b2143cd3a805cb238e5057",
                "b653d77479b36e9d804a5e8ca78adbbfe9ce0b82fd8e45512cf7f3ad175b945c") and
   not (process.name : "rundll32.exe" and process.command_line : "*PcaSvc.dll,PcaPatchSdbTask*" and
        process.parent.executable : "?:\\Windows\\System32\\svchost.exe") and
   not (process.executable : "?:\\WINDOWS\\system32\\wermgr.exe" and
        process.args : "-upload" and process.parent.executable : "?:\\Windows\\System32\\svchost.exe")
 ]
 [dns where 
  dns.question.name : ("*letsencrypt.org", "*.sslforfree.com", "*.zerossl.com", "*.freessl.org", "*.lencr.*")]
'''

min_endpoint_version = "8.4.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1204"
name = "User Execution"
reference = "https://attack.mitre.org/techniques/T1204/"
[[threat.technique.subtechnique]]
id = "T1204.002"
name = "Malicious File"
reference = "https://attack.mitre.org/techniques/T1204/002/"



[threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1071"
name = "Application Layer Protocol"
reference = "https://attack.mitre.org/techniques/T1071/"

[[threat.technique]]
id = "T1573"
name = "Encrypted Channel"
reference = "https://attack.mitre.org/techniques/T1573/"


[threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"

[internal]
min_endpoint_version = "8.4.0"
