[rule]
description = """
Identifies the Osascript process accessing SSH keys. Adversaries may steal SSHkeys in order to gain elevated privileges
or move laterally to another system.
"""
id = "2156b881-5f00-4d2f-a43f-9f48184545d6"
license = "Elastic License v2"
name = "SSH Keys Accessed by Osascript"
os_list = ["macos"]
version = "1.0.3"

query = '''
file where event.action == "open" and 
 file.path : "/Users/*/.ssh/*" and process.name : "osascript"
'''

min_endpoint_version = "8.11.1"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1552"
name = "Unsecured Credentials"
reference = "https://attack.mitre.org/techniques/T1552/"
[[threat.technique.subtechnique]]
id = "T1552.004"
name = "Private Keys"
reference = "https://attack.mitre.org/techniques/T1552/004/"



[threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

[internal]
min_endpoint_version = "8.11.1"
