[rule]
description = """
Identifies instances of RunDLL32 or Regsvr32 loading a DLL with from an unbacked memory region. Adversaries often abuse
those programs to proxy execution of malicious code.
"""
id = "226df8a0-6ef8-4965-91b4-7ce64078c206"
license = "Elastic License v2"
name = "Rundll32 or Regsvr32 Loaded a DLL from Unbacked Memory"
os_list = ["windows"]
version = "1.0.9"

query = '''
sequence by process.entity_id
 [process where event.action == "start" and
  (process.name : ("rundll32.exe", "regsvr32.exe") or process.pe.original_file_name : ("rundll32.exe", "regsvr32.exe")) and

  not (process.name : "rundll32.exe" and
       process.command_line : "*zzzzInvokeManagedCustomActionOutOfProc*" and process.parent.executable : "?:\\Windows\\Sys*\\msiexec.exe") and

  not (process.executable : "?:\\Windows\\sys*\\rundll32.exe" and
       process.args : "--type=gpu-process" and process.parent.args : "--enable-speech-input" and
       process.parent.executable : "?:\\Windows\\sys*\\rundll32.exe") and

  not (process.command_line : "\"C:\\Windows\\sys*\\rundll32.exe\"  --enable-speech-input --enable-media-stream --no-sandbox" and
       process.parent.executable : ("?:\\Program Files\\*", "?:\\Program Files (x86)\\*")) and

  not process.parent.executable :
                     ("?:\\Program Files\\Royal TS V6\\RoyalTS.exe",
                      "?:\\Program Files (x86)\\Kaarya LLC\\myKaarma Desktop\\KaarmaDesktop.exe",
                      "?:\\Program Files (x86)\\Steam\\steamapps\\common\\Sun Haven\\Sun Haven.exe") and

  not (process.args : "--zoam=IndexCigar\\license.dat" and process.parent.executable : "?:\\Windows\\System32\\svchost.exe")
  ]
 [library where dll.name : ("wininet.dll", "ws2_32.dll", "winhttp.dll", "vaultcli.dll") and
  process.thread.Ext.call_stack_summary :
                  ("*ntdll.dll|kernelbase.dll|Unbacked*",
				   "ntdll.dll|iphlpapi.dll|Unbacked",
				   "ntdll.dll|wow64.dll|wow64cpu.dll|wow64.dll|ntdll.dll|wininet.dll|Unbacked|kernel32.dll|ntdll.dll",
				   "ntdll.dll|wow64.dll|wow64cpu.dll|wow64.dll|ntdll.dll|winhttp.dll|Unbacked|kernel32.dll|ntdll.dll",
				   "ntdll.dll|wow64.dll|wow64cpu.dll|wow64.dll|ntdll.dll|wow64cpu.dll|wow64.dll|ntdll.dll|kernelbase.dll|wininet.dll|Unbacked") and
  not _arraysearch(process.thread.Ext.call_stack, $entry,
                   $entry.callsite_trailing_bytes :
                         ("*8945b4488bcce82c000000908b45b4488b55a8c6420c01488b55a8488b*",
                          "48898424e80300004883bc24e803000000750eff94247e030000898424f0030000eb30488d8c2430010000ff94248e03000048898424e80300004883bc24e803",
                          "8bd885db751eff55c88945f8eb168d8592fdffff50ff55d08bd885db7506ff55c88945f856ff55bc85db0f847601000080bd82fcffff0074508b45fc05a00000",
                          "488b55a8c6420c01833d8bbeb25f007406ff1593c7b25f8945b4488bcce82c000000908b45b4488b55a8c6420c01488b55a8488b8d70ffffff48894a10488d65",
                          "8945f86858ec0110ff75f8ff75fce8f9ebffff8945f48b45fc8b4df48988c0020000c9c3558bec83ec0c894dfc8b45fc83b80402000000752a8b4dfce8e1edff"))

  ]
  until [process where event.action == "end"]
'''

min_endpoint_version = "8.8.0"
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[optional_actions]]
action = "rollback"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1055"
name = "Process Injection"
reference = "https://attack.mitre.org/techniques/T1055/"

[[threat.technique]]
id = "T1218"
name = "System Binary Proxy Execution"
reference = "https://attack.mitre.org/techniques/T1218/"
[[threat.technique.subtechnique]]
id = "T1218.010"
name = "Regsvr32"
reference = "https://attack.mitre.org/techniques/T1218/010/"

[[threat.technique.subtechnique]]
id = "T1218.011"
name = "Rundll32"
reference = "https://attack.mitre.org/techniques/T1218/011/"



[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "8.8.0"
