[rule]
description = """
Identifies the load of an unsigned or untrusted DLL by a trusted binary followed by calling VirtualProtect API to change
memory permission to execute or write. This may indicate execution via DLL sideloading to perform code injection.
"""
id = "8858facd-72b7-495c-831c-4d8ad12a8bf0"
license = "Elastic License v2"
name = "VirtualProtect API Call from an Unsigned DLL"
os_list = ["windows"]
version = "1.0.17"

query = '''
sequence by process.entity_id
[library where process.name != null and
   (dll.Ext.relative_file_creation_time <= 900 or
    dll.Ext.relative_file_name_modify_time <= 900 or
    (dll.Ext.device.product_id : ("Virtual DVD-ROM", "Virtual Disk","USB *") and not dll.path : "C:\\*") or
    dll.path : ("\\Device\\Mup\\*", "?:\\Users\\Public\\*", "?:\\Windows\\Tasks\\*", "?:\\ProgramData\\*")) and
    not dll.code_signature.status : "trusted" and dll.hash.sha256 != null and
    not dll.path : ("?:\\Windows\\Installer\\*",
                    "?:\\Windows\\System32\\DriverStore\\FileRepository\\*",
                    "?:\\Windows\\SysWOW64\\DriverStore\\FileRepository\\*",
                    "?:\\Windows\\assembly\\*", 
                    "?:\\Windows\\twain_32\\*") and

  not (process.code_signature.trusted == true and
       process.code_signature.subject_name :
                         ("PFU LIMITED", "Sky UK Limited", "Genetec inc", "Sky International AG",
                          "EFI Software (Electronics for Imaging, Inc.)", "Amazon.com Services LLC",
                          "VICON INDUSTRIES, INC.")) and

  not (dll.name : "chrome_elf.dll" and dll.pe.original_file_name : "chrome_elf.dll") and 
  not dll.hash.sha256 : 
               ("624bf5fbf96b6399fe0a624c8da7122cc207dba4273d6373fac7796d2dc1bed9", 
                "dfa6e54b8c5659abcf7f1ac605379afcde27f713ca6a071e9da1367c5f5098ea", 
                "4b3d1f4ec733afa5c593be64f251560515b91cb328e5c741ff877455aff0d453", 
                "b950c9f7fb8e9b558d9caf634d7463fb4bf0aaf69a501d8f922763f8837b0ad2",
                "6eed2886728608f1b3f4a54a7a7d338ef1b1669f6f53a5d38bcd352f0ec755c9",
                "139a3fba0e2035830021d50bd24b73dc6d5b8b0520ee6d946ebef1ec2f602ff0",
                "127ebabd8e20267bdd26165cd26398bd9225d89b2977ff8de2b5f9da8a231e67",
                "4a23537d3523441a06b705bca6a7bd601c450b17a0586d669b07fd86c1dc0962",
                "3ed846264d5003acbd0dd624cbe4ca84606fe897fd8caa29350621906a3e28c0",
                "b211c61e1fa89cbaf4570ee5f9712772582b2f4bb23597549ec32ea066a20b76",
                "deaf71807722382d05244160ee35b1a14c0e621d7caf74c863475669e5c95b35",
                "7bafd0da58d427bbe8a2d34c953a53809bcbb3ff6c6f90b8acbe6c2b3ab8fa08",
                "8747dc251af9c3192bad2001786c626ad03903c3afaadb8c6a8c2627c66730bd",
                "5c45a7439d127c09b74fa16a0b300fb290ba15d316397579985464be484b8e17",
                "262816adf053d82039f17512bb4e168020cc7f5f37efdf712589a22b89903a80",
                "96c8eb8c7ad08ef045861b711b1655df7346cd387580ba038d74e938f2037bf5", 
                "0c33dfdc0e86f85a0e848cfbb8820868a1df2cedb850ccaf9831659d1c00e3ee", 
                "454f7d08b4e572051be599d04f202518311f9af62e2046e4640b2b2dcbab1ff2", 
                "4e6a640686b467ea054785430b87cdce7579a03cbdc7934dd26b30212ea04318", 
                "43bb2dabb8bb734f32c73df321f8cb39794568c0aad4f020867f8878852747a4", 
                "55bfb4a17b931176304990be2f502c4e8b29c6ee2893527d973740e2104ca92f", 
                "c90a438b8de5d948e5f834ace04a0e34d20121d21b5a64b04f07bc3be2c349d9", 
                "3cc352ae187aeb3467649ea1a6c7351f42d703c42570873891e22dddd5aa1650", 
                "ff7a3550d183e202f16074f71744f3500b99a3fe8bd6f7d3c14d570854b2e06e", 
                "55bfb4a17b931176304990be2f502c4e8b29c6ee2893527d973740e2104ca92f", 
                "ddcbecf2cd2cd4904cf21e3db40c6a918df0ed3b258473fc5d6e2688dee72696", 
                "454f7d08b4e572051be599d04f202518311f9af62e2046e4640b2b2dcbab1ff2", 
                "7c47cf9b3881355cb36781ee187adc45004f0a4239b6592c3628cf559835e515", 
                "34de1c3d74bcff8452bdd05251e9ac3f37fa73d7d0d842c5ccf8f1d4be31e733", 
                "4e6a640686b467ea054785430b87cdce7579a03cbdc7934dd26b30212ea04318", 
                "0107b58df1574083db235906c3ed6897561fbcaef4921d01d76d80e4cf5c6cee", 
                "55bfb4a17b931176304990be2f502c4e8b29c6ee2893527d973740e2104ca92f", 
                "f03e30c6a8c883b0d2086894675f76c772368865bb1394274f1e7ae3284ab80a")] as event0
[api where
  process.Ext.api.name : "VirtualProtect*" and process.Ext.api.parameters.protection : ("*X*", "*W*") and
  not process.thread.Ext.call_stack_final_user_module.name : "Kernel" and
  (
    _arraysearch(process.thread.Ext.call_stack, $entry, stringcontains~($entry.protection_provenance, event0.dll.name)) or

    startswith~(process.thread.Ext.call_stack_summary, concat("ntdll.dll|kernelbase.dll|", event0.dll.name)) or

    startswith~(process.thread.Ext.call_stack_summary, concat("ntdll.dll|kernelbase.dll|Unknown|", event0.dll.name)) or

    startswith~(process.thread.Ext.call_stack_summary, concat("ntdll.dll|wow64.dll|wow64cpu.dll|wow64.dll|ntdll.dll|kernelbase.dll|", event0.dll.name)) or

    startswith~(process.thread.Ext.call_stack_summary, concat("ntdll.dll|", event0.dll.name)) or

    startswith~(process.thread.Ext.call_stack_summary, concat("ntdll.dll|wow64.dll|wow64cpu.dll|wow64.dll|ntdll.dll|", event0.dll.name)) or

    startswith~(process.thread.Ext.call_stack_summary, concat("ntdll.dll|wow64.dll|wow64cpu.dll|wow64.dll|ntdll.dll|kernelbase.dll|Unknown|", event0.dll.name)) or

    startswith~(process.thread.Ext.call_stack_summary, concat("ntdll.dll|wow64.dll|wow64cpu.dll|wow64.dll|ntdll.dll|Unknown|kernelbase.dll|Unbacked|", event0.dll.name))
  )
 ]
 until [process where event.action:"end"]
'''

min_endpoint_version = "8.10.0"
reputation = true
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[optional_actions]]
action = "rollback"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1055"
name = "Process Injection"
reference = "https://attack.mitre.org/techniques/T1055/"

[[threat.technique]]
id = "T1574"
name = "Hijack Execution Flow"
reference = "https://attack.mitre.org/techniques/T1574/"
[[threat.technique.subtechnique]]
id = "T1574.002"
name = "DLL Side-Loading"
reference = "https://attack.mitre.org/techniques/T1574/002/"



[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "8.10.0"
