[rule]
description = """
Identifies calls to Memory injection related Windows APIs from a process executing from a mounted virtual disk or a
removable device. This may indicate an attempt to get initial access via malicious ISO or USB devices.
"""
id = "9d5f965f-6f77-45df-9733-8707e40d1d71"
license = "Elastic License v2"
name = "Suspicious Windows API Call from Virtual Disk or USB"
os_list = ["windows"]
version = "1.0.4"

query = '''
sequence by process.entity_id
[process where event.action == "start" and
   process.Ext.device.product_id : ("Virtual DVD-ROM", "Virtual Disk", "USB *") and 
   not process.executable : "C:\\*" and not process.Ext.device.nt_name: "\\Device\\HarddiskVolume*" and 
   not process.Ext.device.vendor_id == "Citrix" and 
   not (process.code_signature.subject_name : ("Veeam Software Group GmbH", "VMware, Inc.") and process.code_signature.trusted == true)]
[api where event.category : "intrusion_detection" and
  not process.Ext.api.summary :
                      ("VirtualProtect( user32.dll, 0x24, RW-, R-X )",
                       "VirtualProtect( clr.dll, 0x8, R--, RWX )",
                       "VirtualProtect( user32.dll, 0x1000, R-X, RW- )") and
  not (process.Ext.api.behaviors : "protection_fluctuation" and process.Ext.api.parameters.protection == "RW-")]
 until [process where event.action:"end"]
'''

min_endpoint_version = "8.8.0"
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[optional_actions]]
action = "rollback"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1055"
name = "Process Injection"
reference = "https://attack.mitre.org/techniques/T1055/"


[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "8.8.0"
