[rule]
description = """
Detects the attempt of in memory Mach-O loading on MacOS Monterey specifically by looking for the predictable temporary
file creation of "NSCreateObjectFileImageFromMemory-*******" in the /tmp directory.
"""
id = "16fba7a9-f8f6-43ce-ae24-6a392a48e49c"
license = "Elastic License v2"
name = "Reflective Binary Load"
os_list = ["macos"]
reference = [
    "https://slyd0g.medium.com/understanding-and-defending-against-reflective-code-loading-on-macos-e2e83211e48f",
    "https://github.com/slyd0g/SwiftInMemoryLoading",
]
version = "1.0.38"

query = '''
file where event.type != "deletion" and 
file.name : "NSCreateObjectFileImageFromMemory-*" and 
not (process.name : ("osx-x86_64", 
                     "Setup",
                     "oahd-helper",
                     "ArtPro",
                     "Dolby Atmos Renderer",
                     "ARCHICAD",
                     "oahd",
                     "pluginrunner",
                     "Install") and 
     process.code_signature.trusted == true) and 
not Effective_process.executable : ("/Applications/Monotype desktop app/Monotype desktop app.app/Contents/MacOS/masMonitor",
                                    "/Applications/Amazon Music.app/Contents/MacOS/Amazon Music",
                                    "/Applications/GRAPHISOFT/ARCHICAD 24/ARCHICAD 24.app/Contents/MacOS/ARCHICAD",
                                    "/Applications/SoundFlow.app/Contents/Helpers/SoundFlow.app/Contents/MacOS/sfbackend",
                                    "/Applications/iZotope Product Portal.app/Contents/MacOS/Product Portal") and
not process.executable : ("/System/*", 
                          "/Library/Application Support/Native Instruments/Komplete Kontrol/ScanApp3.app/Contents/MacOS/ScanApp3",
                          "/Applications/Logic Pro X.app/Contents/MacOS/Logic Pro X",
                          "/Applications/Avid/AvidAudioServer/AvidAudioServer.app/Contents/MacOS/AvidAudioServer",
                          "/Applications/Pro Tools.app/Contents/MacOS/Pro Tools",
                          "/Applications/Reason 12.app/Contents/MacOS/Reason",
                          "/Applications/Reason 12.app/Contents/MacOS/PlugInspector",
                          "/Library/Application Support/Native Instruments/Maschine 2/ScanApp.app/Contents/MacOS/ScanApp",
                          "/Applications/REAPER.app/Contents/MacOS/REAPER",
                          "/Applications/Avid Media Composer/AvidMediaComposer.app/Contents/MacOS/AvidMediaComposer",
                          "/Applications/Neural DSP/*",
                          "/usr/bin/auvaltool",
                          "/Library/Application Support/Native Instruments/Komplete Kontrol/ScanApp.app/Contents/MacOS/ScanApp",
                          "/Applications/TouchDesigner.app/Contents/MacOS/TouchDesigner",
                          "/Applications/Ableton Live 11 Suite.app/Contents/MacOS/Live",
                          "/Applications/Ableton Live 11 Suite.app/Contents/App-Resources/Extensions/PluginScanner/Ableton Plugin Scanner")
'''

min_endpoint_version = "8.11.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1106"
name = "Native API"
reference = "https://attack.mitre.org/techniques/T1106/"


[threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1620"
name = "Reflective Code Loading"
reference = "https://attack.mitre.org/techniques/T1620/"


[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "8.11.0"
