[rule]
description = """
Identifies attempts to hide Windows Command Console Window. Adversaries may use DeviceCredentialDeployment to evade user
suspicion.
"""
id = "6c8c6292-a7f0-49b3-9c24-f4147ad7b860"
license = "Elastic License v2"
name = "Evasion via Device Credential Deployment"
os_list = ["windows"]
reference = ["https://lolbas-project.github.io/lolbas/Binaries/DeviceCredentialDeployment/"]
version = "1.0.7"

query = '''
process where event.action == "start" and
 (
  (process.name : "cmd.exe" and process.command_line : "*DeviceCredentialDeployment*") or
  ((process.pe.original_file_name : "\"DeviceCredentialDeployment.exe\"" or process.name : "DeviceCredentialDeployment.exe") and
    process.parent.name : ("cmd.exe", "powershell.exe"))
 )
'''

min_endpoint_version = "7.16.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1218"
name = "System Binary Proxy Execution"
reference = "https://attack.mitre.org/techniques/T1218/"
[[threat.technique.subtechnique]]
id = "T1218.011"
name = "Rundll32"
reference = "https://attack.mitre.org/techniques/T1218/011/"



[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "7.16.0"
