[rule]
description = """
Identifies execution from an unsigned or untrusted browser native messaging application. Adversaries may install a rogue
browser native messaging host to maintain persistence via malicious browser extension.
"""
id = "e83880c5-1d82-4dbd-9816-34e4c32caf27"
license = "Elastic License v2"
name = "Execution via Untrusted Browser Native Messaging Application"
os_list = ["windows"]
reference = [
    "https://developer.chrome.com/docs/apps/nativeMessaging/",
    "https://www.trendmicro.com/en_us/research/23/b/earth-kitsune-delivers-new-whiskerspy-backdoor.html",
]
version = "1.0.9"

query = '''
process where event.action == "start" and

 (
  (process.parent.name : "cmd.exe" and process.parent.args : "\\\\.\\pipe\\*.nativeMessaging.*" and
   (process.code_signature.trusted == false or process.code_signature.exists == false) and
   not process.code_signature.status : ("errorExpired", "errorCode_endpoint*") and
   not process.executable : ("?:\\Program Files\\*", "?:\\Program Files (x86)\\*") and
   not process.parent.args :
              (
               "chrome-extension://aicmkgpgakddgnaphhhpliifpcfhicfo/",
               "chrome-extension://aeblfdkhhhdcdjpifhhbdiojplfjncoa/",
               "chrome-extension://dgpgholdldjjbcmpeckiephjigdpikan/",
               "chrome-extension://dhcpobccjkdnmibckgpejmbpmpembgco/",
               "chrome-extension://mhmphnocemakkjdampibehejoaleebpo/",
               "chrome-extension://dppgmdbiimibapkepcbdbmkaabgiofem/",
               "chrome-extension://gfgmdlpkjanpmiikhnkldcjmpnfidnco/",
               "chrome-extension://kfkoineenohoofaigpoafaadfigmabld/",
               "chrome-extension://kbgcmngfhjmmpkepmbcacbkmaeilfmno/"
              )) or

  (descendant of [process where event.action == "start" and
                  process.parent.name : "cmd.exe" and process.parent.args : "\\\\.\\pipe\\*.nativeMessaging.*" and
                  (process.code_signature.trusted == false or process.code_signature.exists == false) and
                  not process.executable : ("?:\\Program Files\\*", "?:\\Program Files (x86)\\*") and
                  not process.parent.args :
                                    (
                                     "chrome-extension://aicmkgpgakddgnaphhhpliifpcfhicfo/",
                                     "chrome-extension://aeblfdkhhhdcdjpifhhbdiojplfjncoa/",
                                     "chrome-extension://dgpgholdldjjbcmpeckiephjigdpikan/",
                                     "chrome-extension://dhcpobccjkdnmibckgpejmbpmpembgco/",
                                     "chrome-extension://mhmphnocemakkjdampibehejoaleebpo/",
                                     "chrome-extension://dppgmdbiimibapkepcbdbmkaabgiofem/",
                                     "chrome-extension://gfgmdlpkjanpmiikhnkldcjmpnfidnco/",
                                     "chrome-extension://kfkoineenohoofaigpoafaadfigmabld/",
                                     "chrome-extension://kbgcmngfhjmmpkepmbcacbkmaeilfmno/"
                                     )])
 ) and 
  
  not process.executable :
                ("?:\\Windows\\Microsoft.NET\\Framework*\\dfsvc.exe",
                 "?:\\Program Files\\*.exe", 
                 "?:\\Program Files (x86)\\*", 
                 "?:\\Windows\\System32\\conhost.exe",
                 "?:\\Windows\\Microsoft.NET\\Framework*\\vbc.exe",
                 "?:\\Windows\\Microsoft.NET\\Framework*\\cvtres.exe") and
  not process.parent.executable : "?:\\Windows\\Microsoft.NET\\Framework*\\dfsvc.exe" and 
  not process.hash.sha256 :
               ("af0a5a9d2b22c2e440f24b2a75f7a064b8855ff0989b577b7cca0bb8e5b26d62",
                "5dd9b8b313a020ecb47c8abc5f5f7c2cd6346a574dab7d8fa528d50a3efd4bcf",
                "6feaea10fa48a077b43d21f423c16cd78c928ec7caa5eae379b64b51e01c4f09",
                "154b04d3526ceb79b6e4b096d28f94501fc3748ad0e59c10bb42d9a8eecfa741",
                "af862b278038dc2a84dee82932cfdcffc837a747c7852dc905de72300c6fd937",
                "d9fdfe1f8fb03c430a4fe739af3b1c86f23a941b96513a2536caa7370dfa1cb8",
                "c00b1aedc14b6d11f8af36a5ca7cd23c349de4213254aa1b7bd8c7c8d15900f8",
                "f649d010713be56a21f83fb9abfcce453ae805473c5d28d9a00f28d16f4cec62",
                "e14e2edcfaddff1eff81ad4b837649b2b1f3a425cce1ea314667949cd450e384",
                "f32ff940b9cb7f166ff2fe055c5776489168edd9445e7d726f246489b57b93e6",
                "26a3df875ac4e1bb02c9916b761d62d7b12b0557d6f3754bebd11b61ab6a7067",
                "c7ff87ef40a98b367fde08a75192159b044ae8926085bf49310d97088b6306df",
                "f3ec3fdb6f66c9334362c6ad170cec6edc96e304381136c133859c5924f136a4", 
                "994e14d2bb306607c158c6799e0661c90ee1a480378aca969c9397e4712a4c38", 
                "2d2de0f9efb9dba04c01dabbbb05227a76e8366f9741a410e5fb588a9cc50cb9", 
                "030fc8b93d36df594b3df166360be7c2949065f13595261d43a462a92dee81d2", 
                "fef7f124b4352e53d01c2acf40f145836b9171a07753f0dee09edb5ddec65ecc", 
                "2e409d692d5fa32735033e0ac6d49d8a23fb8f93d2bc37782830044f267b7dfb", 
                "dcf9424bcbed483001b8846e701eb3652fc8f4077c151e3210e9d7d2e1f38624", 
                "008e607c5a70884971978d65533ea6e1c84ee7759e4970c847ebda6fcdfb29d6", 
                "d0d66cc8a419f964004d0ecb493ec5b3adb88d2fa7b55c2579940efd033fb059")
'''

min_endpoint_version = "8.0.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1176"
name = "Browser Extensions"
reference = "https://attack.mitre.org/techniques/T1176/"


[threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

[internal]
min_endpoint_version = "8.0.0"
