[rule]
description = """
Identifies attempts to bypass User Account Control (UAC) via DLL search order hijacking. Attackers may attempt to bypass
UAC to stealthily execute code with elevated permissions.
"""
id = "9389bb8e-fadc-42ca-8598-28e2bb94edee"
license = "Elastic License v2"
name = "UAC Bypass Attempt via SilentCleanup Task DLL Search Order Hijacking"
os_list = ["windows"]
reference = ["https://github.com/EncodeGroup/UAC-SilentClean"]
version = "1.0.26"

query = '''
sequence by user.id with maxspan=1m
   [library where
    dll.path : "?:\\Users\\*\\AppData\\Local\\Microsoft\\WindowsApps\\api-ms-win-core-kernel32-legacy-l1.dll" and
    process.executable : "?:\\Users\\*\\AppData\\Local\\Temp\\*\\DismHost.exe"] by process.entity_id
   [process where event.action == "start" and process.Ext.token.integrity_level_name == "high" and
    process.parent.executable : "?:\\Users\\*\\AppData\\Local\\Temp\\*\\DismHost.exe" and
    not (process.executable : ("?:\\Users\\*\\AppData\\Local\\Temp\\*\\DismHost.exe", "?:\\Windows\\System32\\wermgr.exe") and
         process.code_signature.trusted == true and process.code_signature.subject_name : "Microsoft *")] by process.parent.entity_id
'''

min_endpoint_version = "7.16.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 1

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1548"
name = "Abuse Elevation Control Mechanism"
reference = "https://attack.mitre.org/techniques/T1548/"
[[threat.technique.subtechnique]]
id = "T1548.002"
name = "Bypass User Account Control"
reference = "https://attack.mitre.org/techniques/T1548/002/"



[threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1574"
name = "Hijack Execution Flow"
reference = "https://attack.mitre.org/techniques/T1574/"
[[threat.technique.subtechnique]]
id = "T1574.001"
name = "DLL Search Order Hijacking"
reference = "https://attack.mitre.org/techniques/T1574/001/"



[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "7.16.0"
