[rule]
description = """
Identifies attempts to bypass User Account Control (UAC) via sdclt.exe. Attackers bypass UAC to stealthily execute code
with elevated permissions.
"""
id = "e9095298-65e0-40a2-97c9-055de8685645"
license = "Elastic License v2"
name = "UAC Bypass via Sdclt"
os_list = ["windows"]
reference = ["https://github.com/hfiref0x/UACME"]
version = "1.0.30"

query = '''
process where event.action == "start" and
 process.parent.name : "sdclt.exe" and process.parent.command_line : "*/kickoffelev*" and
 process.Ext.token.integrity_level_name == "high" and
 not process.executable :
           ("?:\\Windows\\SysWOW64\\sdclt.exe",
            "?:\\Windows\\System32\\sdclt.exe",
            "?:\\Windows\\SysWOW64\\control.exe",
            "?:\\Windows\\System32\\control.exe",
            "?:\\Windows\\System32\\WerFault.exe",
            "?:\\Windows\\SysWOW64\\WerFault.exe",
            "?:\\Windows\\System32\\wermgr.exe",
            "?:\\Windows\\SysWOW64\\wermgr.exe")
'''

min_endpoint_version = "7.15.0"
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[optional_actions]]
action = "rollback"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1548"
name = "Abuse Elevation Control Mechanism"
reference = "https://attack.mitre.org/techniques/T1548/"
[[threat.technique.subtechnique]]
id = "T1548.002"
name = "Bypass User Account Control"
reference = "https://attack.mitre.org/techniques/T1548/002/"



[threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"

[internal]
min_endpoint_version = "7.15.0"
