[rule]
description = """
Identifies the creation of LSASS memory crash dump via an unusual parent process. Adversaries may abuse the Windows
Error Reporting service to proxy LSASS dumping as a preparation for credential access.
"""
id = "19cd9212-034a-4835-a0a9-617299b94060"
license = "Elastic License v2"
name = "LSA Dump via Windows Error Reporting"
os_list = ["windows"]
reference = ["https://github.com/deepinstinct/Lsass-Shtinkering"]
version = "1.0.22"

query = '''
sequence by process.entity_id with maxspan=1m
 [process where event.action == "start" and process.name : ("WerFaultSecure.exe", "WerFault.exe") and
  not process.parent.executable : "?:\\Windows\\System32\\lsass.exe" and process.parent.executable != null]
 [file where event.action == "creation" and file.name : "lsass*.dmp"]
'''

min_endpoint_version = "7.15.0"
[[actions]]
action = "kill_process"
field = "process.parent.entity_id"
state = 0

[[optional_actions]]
action = "rollback"
field = "process.parent.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1003"
name = "OS Credential Dumping"
reference = "https://attack.mitre.org/techniques/T1003/"
[[threat.technique.subtechnique]]
id = "T1003.001"
name = "LSASS Memory"
reference = "https://attack.mitre.org/techniques/T1003/001/"



[threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

[internal]
min_endpoint_version = "7.15.0"
