[rule]
description = """
Identifies the execution of a process in an unusual desktop. This may indicate an attempt to conceal malicious activity
from the plain sight of users.
"""
id = "06c4782f-32fc-465b-b966-95287dc3005d"
license = "Elastic License v2"
name = "Execution from Unusual Desktop"
os_list = ["windows"]
reference = [
    "https://attack.mitre.org/techniques/T1564/003/",
    "https://www.elastic.co/security-labs/elastic-security-labs-discovers-lobshot-malware",
]
version = "1.0.3"

query = '''
process where event.type == "start" and
 process.Ext.desktop_name : "??*" and
 not process.Ext.desktop_name : ("Service-0x0-*$\\*", "mssrestricteddesk", "Default", "Winsta0\\Winlogon")
'''

min_endpoint_version = "9.1.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1564"
name = "Hide Artifacts"
reference = "https://attack.mitre.org/techniques/T1564/"
[[threat.technique.subtechnique]]
id = "T1564.003"
name = "Hidden Window"
reference = "https://attack.mitre.org/techniques/T1564/003/"



[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "9.1.0"
