[rule]
description = "Identifies suspicious execution via Distributed Component Object Model service to launch an application via Excel."
id = "e9825fa0-7fc3-468e-84dc-386aa9f92d20"
license = "Elastic License v2"
name = "Execution via DCOM Excel Application"
os_list = ["windows"]
reference = [
    "https://posts.specterops.io/lateral-movement-abuse-the-power-of-dcom-excel-application-3c016d0d9922",
]
version = "1.0.4"

query = '''
process where event.action == "start" and 
 process.parent.name : "excel.exe" and process.parent.args : "-Embedding" and 
 process.name : ("FOXPROW.exe", "SCHDPLUS.exe", "WINPROJ.exe")
'''

min_endpoint_version = "8.0.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0
tree = true

[[actions]]
action = "kill_process"
field = "process.parent.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1218"
name = "System Binary Proxy Execution"
reference = "https://attack.mitre.org/techniques/T1218/"


[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1021"
name = "Remote Services"
reference = "https://attack.mitre.org/techniques/T1021/"
[[threat.technique.subtechnique]]
id = "T1021.003"
name = "Distributed Component Object Model"
reference = "https://attack.mitre.org/techniques/T1021/003/"



[threat.tactic]
id = "TA0008"
name = "Lateral Movement"
reference = "https://attack.mitre.org/tactics/TA0008/"

[internal]
min_endpoint_version = "8.0.0"
