[rule]
description = """
Identifies the load of a library with a modified file creation time. Adversaries may modify file time attributes to
blend malicious content with existing files. Timestomping is a technique that modifies the timestamps of a file often to
mimic files that are in trusted directories.
"""
id = "69b2dd59-13ba-4bda-8d0d-cf0e28eb1323"
license = "Elastic License v2"
name = "Potential Image Load with a Spoofed Creation Time"
os_list = ["windows"]
reference = [
    "https://attack.mitre.org/techniques/T1070/006/",
    "https://posts.specterops.io/revisiting-ttps-timestomper-622d4c28a655",
    "https://www.elastic.co/security-labs/Hunting-for-Suspicious-Windows-Libraries-for-Execution-and-Evasion",
]
version = "1.0.28"

query = '''
sequence with maxspan=5m
 [file where event.action == "creation" and file.Ext.header_bytes : "4d5a*" and

  not user.id : "S-1-5-18" and

  file.path : ("?:\\Windows\\system32\\*", "?:\\Windows\\SysWOW64\\*", "?:\\Program Files\\Microsoft\\*",
               "?:\\Program Files (x86)\\Microsoft\\*", "?:\\Users\\Public\\*", "?:\\ProgramData\\*",
               "?:\\Program Files\\Google\\Chrome\\*.dll", "?:\\Program Files\\Internet Explorer\\*.dll",
               "?:\\Program Files\\Mozilla Firefox\\*.dll") and

  not process.executable :
             ("?:\\Windows\\system32\\msiexec.exe",
              "?:\\Windows\\SysWOW64\\msiexec.exe",
              "?:\\windows\\system32\\drvinst.exe",
              "?:\\windows\\SysWOW64\\drvinst.exe",
              "?:\\Program Files (x86)\\*.exe",
              "?:\\Program Files\\*.exe",
              "?:\\Windows\\System32\\DriverStore\\FileRepository\\*.exe") and

  not (process.code_signature.subject_name : ("Mozilla Corporation", "Google LLC", "JACK HENRY & ASSOCIATES, INC.") and 
       process.code_signature.trusted == true) and
  not file.path : "?:\\ProgramData\\chocolatey\\tools\\detector\\*.dll"
  ] by file.path as event0
 [library where

  /* set to 6months, malwares often spoof creation times to at least 1 years */
  dll.Ext.relative_file_creation_time >= 15778476 and

  /* 5m */
  dll.Ext.relative_file_name_modify_time <= 300 and

  not dll.code_signature.status : ("trusted", "errorExpired", "errorCode_endpoint*") and

  dll.path : ("?:\\Windows\\system32\\*", "?:\\Windows\\SysWOW64\\*", "?:\\Program Files\\Microsoft\\*",
               "?:\\Program Files (x86)\\Microsoft\\*", "?:\\Users\\Public\\*", "?:\\ProgramData\\*",
               "?:\\Program Files\\Google\\Chrome\\*.dll", "?:\\Program Files\\Internet Explorer\\*.dll",
               "?:\\Program Files\\Mozilla Firefox\\*.dll") and

  not startswith~(dll.name, process.name) and

  event0.process.executable != process.executable and

  not (process.executable : ("?:\\Program Files\\*", "?:\\Program Files (x86)\\*") and
       not process.executable : ("?:\\Program Files*\\Microsoft\\*.exe", "?:\\Program Files*\\Google\\Chrome\\*.exe",
                                 "?:\\Program Files*\\Internet Explorer\\*.exe", "?:\\Program Files*\\Mozilla Firefox\\*.exe")) and

  not dll.hash.sha256 :
             ("9ac63dcf5a2437ed43cb143479ec4a810915017d8eb138a7fede88867e2a8121",
              "8bbe5898caa826ac1cb99d6c01c8a5ee9bb660493d2a48c9294d837390f7bae2",
              "42a0d4dca77d4ce7077c18e08b1d49715d6b1038e147611106388aec3e422c82",
              "6e12069312e286307a12ba71228e720e890d242191eb07d0e769630b600098b3",
              "0ae555e24450606fe86938be0450310e8d0da7cd8b661ed79c6f4dc6747cfd95",
              "8180f736781f2af47059a83c73c2c8b9f4423fc764c8897ac7c4f6dd8837a804",
              "c3823447efb2fe8690861541f23890bf5b7a36f40a9c282f4cb33cc3bb3d4689",
              "6324bf7d034935c2781fcef00a9c7b414ffdba4578f5368e09dc892cd49e3ecd",
              "6948e30a0d0eac9584071430d93f4e49645cbaf73ef821d723de6bc00ff13f79",
              "a11c83a10cdcfec7eea0a81ebbcb057513549897c1bdf559dcfb108ace06277f",
              "cd125611cdb5f3a74ee952951a692ee598daa5a7491e87676a4f68930117bb2a",
              "f9032348386637e55788348dc8ed5879daee978be8ab77cd42b0316427d6fbc8") and
  not (process.code_signature.subject_name : ("Epicor Software Corporation", "KONICA MINOLTA, INC.", "3CX Ltd",
                                              "WZT", "Tendyron Corporation","INTUIT INC.",
                                              "MEDENT (Community Computer Service Inc.)") and
       process.code_signature.trusted == true) and
  not (dll.code_signature.subject_name : ("Mozilla Corporation", "Google LLC") and dll.code_signature.trusted == true) and
  not process.executable : "?:\\Windows\\SysWOW64\\regsvr32.exe"
  ] by dll.path
'''

min_endpoint_version = "8.4.0"
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 1

[[optional_actions]]
action = "rollback"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1070"
name = "Indicator Removal"
reference = "https://attack.mitre.org/techniques/T1070/"
[[threat.technique.subtechnique]]
id = "T1070.006"
name = "Timestomp"
reference = "https://attack.mitre.org/techniques/T1070/006/"



[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "8.4.0"
