[rule]
description = """
Identifies abuse of the Microsoft CertOC utility to load an arbitrary DLL. This behavior is used as a defense evasion
technique to blend-in malicious activity with legitimate Windows software.
"""
id = "6fcbf73f-4413-4689-be33-61b0d6bd0ffc"
license = "Elastic License v2"
name = "Suspicious ImageLoad via Windows CertOC"
os_list = ["windows"]
reference = ["https://lolbas-project.github.io/lolbas/Binaries/Certoc/"]
version = "1.0.23"

query = '''
process where event.action == "start" and
  (process.pe.original_file_name == "CertOC.exe" or process.name : "certoc.exe") and process.args : "-LoadDLL"
'''

min_endpoint_version = "7.15.0"
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[optional_actions]]
action = "rollback"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1218"
name = "System Binary Proxy Execution"
reference = "https://attack.mitre.org/techniques/T1218/"


[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "7.15.0"
