[rule]
description = """
Identifies attempts to load a library from a memory section with read, write and execute permissions and backed by a
file. This may indicate image hollowing or unpacking from suspicious memory sections.
"""
id = "a1d00ee9-64d6-440a-8940-fd2d940152a6"
license = "Elastic License v2"
name = "Network Module Loaded from a Backed RWX Memory"
os_list = ["windows"]
version = "1.0.13"

query = '''
sequence by process.entity_id with maxspan=1m
 [process where event.action == "start" and
  (
   (process.Ext.device.product_id : ("Virtual DVD-ROM", "Virtual Disk", "USB *") and
    not process.Ext.device.nt_name: "\\Device\\HarddiskVolume*" and not process.Ext.device.vendor_id == "Citrix") or

   process.name : ("rundll32.exe", "regsvr32.exe", "msiexec.exe") or

   (process.executable : ("?:\\Users\\*", "?:\\ProgramData\\*") and process.Ext.relative_file_creation_time <= 500 and
    not process.code_signature.status : ("trusted", "errorExpired", "errorCode_endpoint*"))
   ) and
  not process.hash.sha256 :
                ("a6061528b62fb3e57ecf48db7d9f760d7df3298aad6fe0231a1a97a5619490b7",
                 "edd35332ab97e86f70132ffa9d8e9cb47d79f12c3c50bf4eb5cf6de55c214d47",
                 "b3f9c9d24914fb770551c6e8563cf93844f31630583a8fec2a529bc785284b92",
                 "e7815d360ab098fdd1f03f10f43f363c73a632e8866e304c72573cf1e6a0dec8",
                 "ae7ef4fb23c6600ca6947226188a597083c0e65bece1db2884debb330addc0c3",
                 "fc91558efb40b16dd9f6b0e93c972a0f1ff85cad3ddefdd7028c2628d75a9ab9",
                 "423e7009c7f9f42166d27becc780bf72c551e2075391ce98d80f46a5abca0373",
                 "53b381da45177f0a612c40e66e9da3231ba47027962feca5fa215aed8b688f57",
                 "e6a734db7c225fba0b255f92bdf0b12d0d657b13c582d56e50e4d4ab8c59fbac",
                 "da8e7721447b4ecb71a9641f347c309d2d33217da2ffbd0348c0c8c7e2595b4f")

  ]
 [library where dll.name : ("ws2_32.dll", "winhttp.dll", "wininet.dll") and
  not process.thread.Ext.call_stack_contains_unbacked == true and
  process.thread.Ext.call_stack_summary : "?*" and
  not process.thread.Ext.call_stack_summary : ("*Unbacked*", "*clr.dll*", "*Unknown*") and
  _arraysearch(process.thread.Ext.call_stack, $entry, $entry.protection : "RWX" and $entry.callsite_trailing_bytes : "?*" and $entry.allocation_private_bytes >= 100000) and
  not _arraysearch(process.thread.Ext.call_stack, $entry,
	                $entry.protection : "RWX" and
	                $entry.symbol_info : ("?:\\Windows\\Temp\\*", "?:\\Windows\\Installer\\*", "?:\\Users\\*\\AppData\\Local\\Temp\\MSI*.tmp*",
	                                      "?:\\Windows\\System32\\*", "?:\\Windows\\Syswow64\\*", "?:\\Program Files*", "*isrt.dll!_InitInstall*",
	                                      "*ISSetup.dll!DllUnregisterServer*", "?:\\Users\\*\\AppData\\Local\\Temp\\nsm????.tmp*")) and
  not (process.name : "msiexec.exe" and process.thread.Ext.call_stack_summary : "*|isrt.dll|*") and
  not process.thread.Ext.call_stack_summary :("*|msi.dll|issetup.dll|*", "*|isrt.dll|issetup.dll|isrt.dll|*", "*|isrt.dll|issetup.dll|*") and
  not process.thread.Ext.call_stack_summary : ("*ntdll.dll|kernelbase.dll|issetup.dll|*", "*ntdll.dll|kernelbase.dll|irsetup.exe*") and
  not _arraysearch(process.thread.Ext.call_stack, $entry,
                   $entry.callsite_trailing_bytes : ("*488b004885c0741d4889542438b903000000ffd0488b5424384885c04989c6*",
                                                     "8bf885ff754eff15*8945ec85ff74168d45cc8bcf506a03ff15*",
                                                     "83c60483fe7072f08d851cfdffffc7851cfd*",
                                                     "8b55ec8bf083fa1072288b4*",
                                                     "894310837b1000750c8bc3e8ee04*",
                                                     "8b55cc89028b151c40420085d2740e8b02ff750c6a0152ff500883c40c8b55cc*",
                                                     "8bd88b4424388b0885db0f85ff00000085c9741783f9ff741f83c9fff00fc1080f95c084*",
                                                     "8945d8e975ffffff8b45c88945a88b450c8945ac8b45108945b08b45c48945b48d45a850ff75cce81f330000837dcc008945d874088b4dcce8fa68ffffb8a815",
                                                     "a1a4e474008bb8980100006a015353538d45d050ff15fc79690085c00f85cafeffff6a0aff15d8756900a1a4e47400ff76308bb898010000ff15f079690085c0"))
 ]
'''

min_endpoint_version = "8.8.0"
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[optional_actions]]
action = "rollback"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1055"
name = "Process Injection"
reference = "https://attack.mitre.org/techniques/T1055/"


[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "8.8.0"
