[rule]
description = """
Identifies the execution of a Micorosft signed binary from a remote working directory followed by spawning a file hosted
on a remote share. This may indicate the successful execution of a remote file via malicious files such as shortcuts.
"""
id = "fc2debc9-b8ad-45e3-b95a-b18ada0350b0"
license = "Elastic License v2"
name = "Execution from a Remote Working Directory"
os_list = ["windows"]
reference = [
    "https://research.checkpoint.com/2025/stealth-falcon-zero-day/",
    "https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2025-33053",
]
version = "1.0.2"

query = '''
sequence with maxspan=1m
[process where event.action == "start" and process.parent.name : ("explorer.exe", "7zFM.exe", "WinRAR.exe", "Bandizip.exe", "7zG.exe") and
 process.working_directory : "\\\\*" and process.code_signature.subject_name in ("Microsoft Windows", "Microsoft Corporation") and
 not process.name : ("cmd.exe", "powershell.exe", "wscript.exe", "cscript.exe", "excel.exe", "outlook.exe", "winword.exe", "devenv.exe")] by process.entity_id
[process where event.action == "start" and process.executable : "\\Device\\Mup*"] by process.parent.entity_id
'''

min_endpoint_version = "8.10.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0
tree = true

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1566"
name = "Phishing"
reference = "https://attack.mitre.org/techniques/T1566/"
[[threat.technique.subtechnique]]
id = "T1566.001"
name = "Spearphishing Attachment"
reference = "https://attack.mitre.org/techniques/T1566/001/"



[threat.tactic]
id = "TA0001"
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0001/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1203"
name = "Exploitation for Client Execution"
reference = "https://attack.mitre.org/techniques/T1203/"


[threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1218"
name = "System Binary Proxy Execution"
reference = "https://attack.mitre.org/techniques/T1218/"


[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "8.10.0"
