[rule]
description = """
Identifies attempts to bypass User Account Control (UAC) via WoW64 logger DLL side-loading. Attackers may attempt to
bypass UAC to stealthily execute code with elevated permissions.
"""
id = "28a39a43-e850-4941-8605-ffa23dcfd25a"
license = "Elastic License v2"
name = "UAC Bypass Attempt via WOW64 Logger DLL Side-Loading"
os_list = ["windows"]
reference = ["https://github.com/hfiref0x/UACME", "http://waleedassar.blogspot.com/2013/01/wow64logdll.html"]
version = "1.0.30"

query = '''
sequence with maxspan=60s
 [library where dll.name : "wow64log.dll" and
  not (dll.code_signature.subject_name : "Microsoft *" and dll.code_signature.trusted == true)
 ] by process.entity_id
 [process where event.action == "start" and
  process.Ext.token.integrity_level_name : ("high", "system") and
  not process.executable :
           ("?:\\Windows\\System32\\WerFault.exe",
            "?:\\Windows\\SysWOW64\\WerFault.exe",
            "?:\\Windows\\System32\\wermgr.exe",
            "?:\\Windows\\SysWOW64\\wermgr.exe",
            "?:\\Windows\\System32\\conhost.exe",
            "?:\\Windows\\SysWOW64\\conhost.exe")] by process.parent.entity_id
'''

min_endpoint_version = "7.15.0"
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 1

[[optional_actions]]
action = "rollback"
field = "process.entity_id"
state = 1

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1548"
name = "Abuse Elevation Control Mechanism"
reference = "https://attack.mitre.org/techniques/T1548/"
[[threat.technique.subtechnique]]
id = "T1548.002"
name = "Bypass User Account Control"
reference = "https://attack.mitre.org/techniques/T1548/002/"



[threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1574"
name = "Hijack Execution Flow"
reference = "https://attack.mitre.org/techniques/T1574/"
[[threat.technique.subtechnique]]
id = "T1574.002"
name = "DLL Side-Loading"
reference = "https://attack.mitre.org/techniques/T1574/002/"



[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "7.15.0"
