[rule]
description = """
Identifies attempts to bypass User Account Control (UAC) via DLL side-loading. Attackers may attempt to bypass UAC to
stealthily execute code with elevated permissions.
"""
id = "38210b91-f593-4c1c-a582-e5309c5b5168"
license = "Elastic License v2"
name = "UAC Bypass Attempt via DismCore DLL Side-Loading"
os_list = ["windows"]
reference = [
    "https://github.com/hfiref0x/UACME",
    "https://app.any.run/tasks/6f2eb616-7786-4d42-9345-b682bda65c6b/",
]
version = "1.0.30"

query = '''
sequence with maxspan=60s
 [file where event.action : "rename" and process.name : ("dllhost.exe", "wusa.exe") and
  file.name : "DismCore.dll" and
  not file.path : ("?:\\Windows\\SoftwareDistribution\\*.dll", "?:\\Windows\\WinSxS\\*.dll")]
 [process where event.action == "start" and
  process.parent.name : "Dism.exe" and process.Ext.token.integrity_level_name == "high" and
  not process.executable :
           ("?:\\Windows\\System32\\WerFault.exe",
            "?:\\Windows\\SysWOW64\\WerFault.exe",
            "?:\\Windows\\System32\\wermgr.exe",
            "?:\\Windows\\SysWOW64\\wermgr.exe",
            "?:\\Windows\\System32\\conhost.exe",
            "?:\\Windows\\SysWOW64\\conhost.exe") and
  not (process.pe.original_file_name == "DismHost.exe" and process.code_signature.trusted == true and
       process.code_signature.subject_name : "Microsoft *")]
'''

min_endpoint_version = "7.15.0"
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 1

[[optional_actions]]
action = "rollback"
field = "process.entity_id"
state = 1

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1548"
name = "Abuse Elevation Control Mechanism"
reference = "https://attack.mitre.org/techniques/T1548/"
[[threat.technique.subtechnique]]
id = "T1548.002"
name = "Bypass User Account Control"
reference = "https://attack.mitre.org/techniques/T1548/002/"



[threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1574"
name = "Hijack Execution Flow"
reference = "https://attack.mitre.org/techniques/T1574/"
[[threat.technique.subtechnique]]
id = "T1574.002"
name = "DLL Side-Loading"
reference = "https://attack.mitre.org/techniques/T1574/002/"



[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "7.15.0"
