[rule]
description = """
Detects executable file downloads via wget to suspicious locations. Threat actors commonly use wget to download
malicious payloads and additional tools.
"""
id = "15bfe54e-d77d-468d-81c5-ef551bc9fdf6"
license = "Elastic License v2"
name = "Executable File Download via Wget"
os_list = ["macos"]
version = "1.0.13"

query = '''
sequence by process.entity_id with maxspan=30s
[network where event.type == "start" and process.name == "wget"]
[file where event.action == "modification" and 
  process.name == "wget" and 
  file.path like ("/tmp/*", "/private/tmp/*", "/private/var/tmp/*", "/var/tmp/*", "/Users/Shared/*") and
  file.Ext.header_bytes like~ ("cffaedfe*", "cafebabe*")]
'''

min_endpoint_version = "8.16.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "Effective_process.entity_id"
state = 1

[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1105"
name = "Ingress Tool Transfer"
reference = "https://attack.mitre.org/techniques/T1105/"


[threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"

[internal]
min_endpoint_version = "8.16.0"
