[rule]
description = """
Detects the use of Osascript to mute the system volume. A new stealer named 'Banshee' was seen doing this in order to
prevent security notifications from possibly being noticed.
"""
id = "6948957d-2988-47a7-b7d8-2dec8bfe172b"
license = "Elastic License v2"
name = "Volume muted via Osascript"
os_list = ["macos"]
version = "1.0.2"

query = '''
process where event.type == "start" and event.action == "exec" and process.name : "osascript" and 
 process.args == "-e" and process.command_line : "*set volume with output muted*"
'''

min_endpoint_version = "8.11.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[threat.technique.subtechnique]]
id = "T1059.002"
name = "AppleScript"
reference = "https://attack.mitre.org/techniques/T1059/002/"



[threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"

[internal]
min_endpoint_version = "8.11.0"
