[rule]
description = """
Detects curl requests to JAMF Pro endpoints from suspicious processes like unsigned binaries or scripting interpreters.
This indicates potential abuse of stolen JAMF credentials for lateral movement in enterprise environments.
"""
id = "57507c39-2cf1-4e46-a903-e4560512942c"
license = "Elastic License v2"
name = "Suspicious Curl to Jamf Endpoint"
os_list = ["macos"]
version = "1.0.2"

query = '''
process where event.type == "start" and event.action == "exec" and process.name in ("curl", "nscurl") and 
 process.command_line : "*https://jamf.*" and ((process.parent.code_signature.exists == false or process.parent.code_signature.trusted == false) or 
 process.parent.name like~ ("python*", "perl", "osascript", "node", "ruby"))
'''

min_endpoint_version = "8.16.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[actions]]
action = "kill_process"
field = "process.parent.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1072"
name = "Software Deployment Tools"
reference = "https://attack.mitre.org/techniques/T1072/"


[threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1072"
name = "Software Deployment Tools"
reference = "https://attack.mitre.org/techniques/T1072/"


[threat.tactic]
id = "TA0008"
name = "Lateral Movement"
reference = "https://attack.mitre.org/tactics/TA0008/"

[internal]
min_endpoint_version = "8.16.0"
