[rule]
description = """
This rule detects when a process creates an in-memory file descriptor (memfd_create) followed by an egress network
connection from an unusual executable. This activity indicates an active attempt to execute a fileless payload and
should be considered highly abnormal or suspicious. This activity can occur when the memfd syscall is used to create a
memory-resident file, such as a payload, and then execute it, after which it establishes outbound network connections
for command-and-control (C2).
"""
id = "3e499558-b79d-4cbb-afa0-dc24a0b59ab2"
license = "Elastic License v2"
name = "Egress Network Connection from Memory File Descriptor"
os_list = ["linux"]
reference = ["https://man7.org/linux/man-pages/man2/memfd_create.2.html"]
version = "1.0.10"

query = '''
sequence by process.entity_id with maxspan=10s
  [process where event.type == "start" and event.action == "memfd_create" and (
    process.executable like (
      "memfd:*", "?memfd:*", "/tmp/*", "/var/tmp/*", "/dev/shm/*", "./*", "/run/user/*", "/var/run/user/*",
      "/boot/*", "/sys/*", "/lost+found/*", "/proc/*", "/var/mail/*", "/var/www/*", "/home/*/*", "/root/*"
    ) or
    (process.name like "python*" and process.args == "-c") or
    (process.name like ("perl*", "ruby*", "lua*", "node", "nodejs") and process.args like "-e*") or
    (process.name like "php*" and process.args like "-r*") or
    process.name like (".*", "*.py", "*.pyc", "*.lua", "*.pl", "*.rb", "*.bin", "*.php", "*.js", "*.mjs") or
    (
      process.name like ("python*", "perl*", "php*", "ruby*", "lua*", "node", "java", "javaw") and
      (
        process.args like (
          "/tmp/*", "/var/tmp/*", "/dev/shm/*", "./*", "/run/user/*", "/var/run/user/*",
          "/boot/*", "/sys/*", "/lost+found/*", "/proc/*", "/var/mail/*", "/var/www/*",
          "/home/*/*", "/root/*"
        ) and process.args_count <= 2
      ) 
    )
  ) and
  process.parent.name in ("bash", "dash", "sh", "tcsh", "csh", "zsh", "ksh", "fish", "mksh", "busybox") and
  not (
    process.executable like (
      "/tmp/.mount_*", "/nix/store/*/bin/.qemu-system-x86_64-wrapped", "/root/.local/share/claude/versions/*", "/home/*/*/*",
      "/usr/bin/qgis.bin", "/app/bin/evolution.bin", "/opt/cpanel/ea-php*/root/usr/bin/php-cgi", "/nix/store/*/bin/.obs-wrapped"
    ) or
    process.command_line == "/usr/bin/php /var/www/glpi/front/cron.php" or
    (
      process.executable == "/home/runner/bin/Runner.Listener" and
      process.Ext.memfd.name == "memfd:doublemapper"
    ) or
    (
      process.name like "php*" and
      process.Ext.memfd.name in ("opcache_lock", "anon_hugepage")
    ) or
    (
      process.executable == "/app/bin/evolution.bin" and
      process.Ext.memfd.name == "memfd:WebKitSharedMemory"
    ) or
    (
      process.name like "python*" and
      process.Ext.memfd.name == "wayland-shm"
    ) or
    (
      process.executable like "/home/*/.local/share/claude/versions/*" and
      process.Ext.memfd.name in ("memfd:spawn_stdio_stdin", "spawn_stdio_stdin")
    ) or
    (
     process.executable like "/home/*/.elixir-install/installs/otp/*/bin/beam.smp" and
     process.Ext.memfd.name == "memfd:vmem"
    ) or
    (
      process.name == "dotnet" and
      process.Ext.memfd.name == "memfd:doublemapper"
    ) or
    (
      process.executable == "/usr/bin/php" and
      process.args like "/var/www/html/*"
    ) or
    (
      process.executable like "/usr/bin/php*" and
      process.working_directory like "/var/www/vhosts/*"
    )
  )]
  [network where event.type == "start" and event.action == "connection_attempted" and 
  not (
    destination.ip == null or destination.ip == "0.0.0.0" or cidrmatch(
    destination.ip, "10.0.0.0/8", "127.0.0.0/8", "169.254.0.0/16", "172.16.0.0/12", "192.0.0.0/24", "192.0.0.0/29",
    "192.0.0.8/32", "192.0.0.9/32", "192.0.0.10/32", "192.0.0.170/32", "192.0.0.171/32", "192.0.2.0/24",
    "192.31.196.0/24", "192.52.193.0/24", "192.168.0.0/16", "192.88.99.0/24", "224.0.0.0/4", "100.64.0.0/10",
    "192.175.48.0/24","198.18.0.0/15", "198.51.100.0/24", "203.0.113.0/24", "240.0.0.0/4", "::1", "FE80::/10",
    "FF00::/8"
    )
  )]
'''

min_endpoint_version = "9.1.4"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 1

[[actions]]
action = "kill_process"
field = "process.parent.entity_id"
state = 0

[[actions]]
action = "kill_process"
field = "process.parent.entity_id"
state = 1

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1106"
name = "Native API"
reference = "https://attack.mitre.org/techniques/T1106/"


[threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1055"
name = "Process Injection"
reference = "https://attack.mitre.org/techniques/T1055/"
[[threat.technique.subtechnique]]
id = "T1055.009"
name = "Proc Memory"
reference = "https://attack.mitre.org/techniques/T1055/009/"


[[threat.technique]]
id = "T1620"
name = "Reflective Code Loading"
reference = "https://attack.mitre.org/techniques/T1620/"


[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"
[[threat]]
framework = "MITRE ATT&CK"

[threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"

[internal]
min_endpoint_version = "9.1.4"
