[rule]
description = """
This rule detects the execution of a command or binary through the crash binary. Attackers may use this technique to
execute commands while attempting to evade detection.
"""
id = "995c8bdb-5ebb-4c5b-9a03-4d39b52c0ff3"
license = "Elastic License v2"
name = "Potential Proxy Execution via Crash"
os_list = ["linux"]
reference = ["https://gtfobins.github.io/gtfobins/crash/"]
version = "1.0.2"

query = '''
process where event.type == "start" and event.action == "exec" and process.parent.name == "crash" and
process.parent.args == "-h" and process.name in ("bash", "dash", "sh", "tcsh", "csh", "zsh", "ksh", "fish") and
process.args == "-c"
'''

min_endpoint_version = "7.15.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[threat.technique.subtechnique]]
id = "T1059.004"
name = "Unix Shell"
reference = "https://attack.mitre.org/techniques/T1059/004/"



[threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1218"
name = "System Binary Proxy Execution"
reference = "https://attack.mitre.org/techniques/T1218/"


[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "7.15.0"
