[rule]
description = """
This rule detects when a process executes a command line containing hexadecimal characters. Malware authors may use
hexadecimal encoding to obfuscate their payload and evade detection.
"""
id = "f2d206e0-97c9-484b-8b6a-5eecd82fbfdc"
license = "Elastic License v2"
name = "Hexadecimal Payload Execution"
os_list = ["linux"]
version = "1.0.9"

query = '''
process where event.type == "start" and event.action == "exec" and process.parent.executable != null and
process.command_line : "*\\x*\\x*\\x*\\x*\\x*\\x*\\x*\\x*\\x*\\x*" and
length(process.command_line) > 50 and not (
  process.parent.executable in (
    "/opt/Tanium/TaniumClient/extensions/comply/jre/bin/java", "/usr/bin/dracut", "/", "/root/.acme.sh/acme.sh",
    "/var/arcticwolfnetworks/agent/scans/jre/jre/bin/java", "/usr/local/bin/cyrisma/App/jre/bin/java", "./unifi.sh",
    "/sbin/supportconfig"
  ) or
  process.parent.executable like ("/home/sites/*/site/stats/awstatsUpdateSite.php", "/tmp/newroot/*") or
  process.parent.name in ("xargs", "su", "sshd", "find", "jem", "vzctl") or
  (
    process.executable == "/usr/bin/printf" and process.parent.args : (
      "/usr/local/bin/testssl.sh*", "/opt/sw/jboss/gsaconfig/mwscripts/pipeline_webserver_reports/*",
      "/usr/bin/testssl", "/tools/testssl/testssl.sh"
      )
  ) or
  process.parent.args : (
    "/usr/bin/dracut", "/home/*/tools/testssl.sh/testssl.sh", "unifi-update.sh", "/opt/tools/testssl.sh/testssl.sh",
    "./testssl.sh"
  ) or
  process.parent.command_line == "xargs printf" or
  process.name in ("systemctl", "ln", "gdb", "su", "vzctl") or
  process.executable like ("/var/lib/docker/overlay2*", "/vz/root/*", "/run/containerd/*")
)
'''

min_endpoint_version = "7.15.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[threat.technique.subtechnique]]
id = "T1059.004"
name = "Unix Shell"
reference = "https://attack.mitre.org/techniques/T1059/004/"


[[threat.technique]]
id = "T1204"
name = "User Execution"
reference = "https://attack.mitre.org/techniques/T1204/"
[[threat.technique.subtechnique]]
id = "T1204.002"
name = "Malicious File"
reference = "https://attack.mitre.org/techniques/T1204/002/"



[threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1027"
name = "Obfuscated Files or Information"
reference = "https://attack.mitre.org/techniques/T1027/"

[[threat.technique]]
id = "T1140"
name = "Deobfuscate/Decode Files or Information"
reference = "https://attack.mitre.org/techniques/T1140/"


[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "7.15.0"
