[rule]
description = """
This rule detects the execution of processes from unusual locations, such as /boot/, /sys/, /lost+found/, /media/, and
/proc/. This may indicate an attempt to execute a process from a location that is not typical for executable files. This
behavior is often associated with malicious activity, such as process injection or execution of payloads from
non-standard directories.
"""
id = "87bd993d-d2fa-4047-bc7b-d6a4527d6ab8"
license = "Elastic License v2"
name = "Unusual Process Execution"
os_list = ["linux"]
version = "1.0.8"

query = '''
process where event.type == "start" and event.action == "exec" and process.executable like (
  "/boot/*", "/sys/*", "/lost+found/*", "/var/mail/*"
) and not (
  process.executable like (
    "/var/spool/postfix", "/sys/dev/block/*", "/boot/loader/entries", "/sys/devices/*", "/sys/fs/cgroup/*",
    "/sys/module/*", "/sys/usr/bin/docker"
  ) or
  process.parent.executable like (
    "/proc/self/fd/*", "/proc/*/exe", "/usr/libexec/postfix/master", "/usr/libexec/postfix/pipe", "/usr/share/code/code",
    "/usr/sbin/slurmstepd", "/usr/sbin/faxq", "/usr/sbin/faxgetty", "/proc/sys/*", "/sys/devices/system/cpu/online*",
    "/proc/*/stat/*", "/sys/kernel/mm/*", "/proc/swaps/*", "/usr/bin/runc", "/bin/runc", "/usr/local/bin/runc",
    "/sys/docker-entrypoint.d/*", "/sys/docker-entrypoint.sh"
  ) or
  process.parent.command_line in ("/usr/bin/runc init", "runc init") or
  process.working_directory like ("/sys/kernel/*", "/proc/sys/*") or
  process.parent.args == "/bin/aws-replication-post-convert.sh"
)
'''

min_endpoint_version = "7.15.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[actions]]
action = "kill_process"
field = "process.parent.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[threat.technique.subtechnique]]
id = "T1059.004"
name = "Unix Shell"
reference = "https://attack.mitre.org/techniques/T1059/004/"



[threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1036"
name = "Masquerading"
reference = "https://attack.mitre.org/techniques/T1036/"

[[threat.technique]]
id = "T1620"
name = "Reflective Code Loading"
reference = "https://attack.mitre.org/techniques/T1620/"


[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "7.15.0"
