[rule]
description = """
Identifies when a built-in utility is used to decode and decrypt a payload from a Linux mount. Malware authors may
attempt to evade detection and trick users into executing malicious code by encoding and encrypting their payload and
placing it in a mount.
"""
id = "bfff8d1b-c4d7-4005-9f49-f494261e5a25"
license = "Elastic License v2"
name = "Linux Payload Decoded and Decrypted from Mount"
os_list = ["linux"]
version = "1.0.5"

query = '''
process where event.action == "exec" and event.type == "start" and process.name == "openssl" and (
  process.working_directory : ("/media/*", "/mnt/*") or process.args : ("/media/*", "/mnt/*")
) and process.args : "enc" and process.args : "-base64" and process.args : "-d"
'''

min_endpoint_version = "7.15.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[threat.technique.subtechnique]]
id = "T1059.004"
name = "Unix Shell"
reference = "https://attack.mitre.org/techniques/T1059/004/"


[[threat.technique]]
id = "T1204"
name = "User Execution"
reference = "https://attack.mitre.org/techniques/T1204/"
[[threat.technique.subtechnique]]
id = "T1204.002"
name = "Malicious File"
reference = "https://attack.mitre.org/techniques/T1204/002/"



[threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1027"
name = "Obfuscated Files or Information"
reference = "https://attack.mitre.org/techniques/T1027/"

[[threat.technique]]
id = "T1140"
name = "Deobfuscate/Decode Files or Information"
reference = "https://attack.mitre.org/techniques/T1140/"


[threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[internal]
min_endpoint_version = "7.15.0"
