[rule]
description = """
This rule detects when a reverse shell is established via a descendant of a Node.js process. Attackers may use Node.js
to run scripts that create reverse shells for various malicious purposes, such as downloading and executing payloads,
establishing persistence, or exfiltrating data.
"""
id = "d9721d27-1f7a-45a5-a847-da76aa98b8d7"
license = "Elastic License v2"
name = "Reverse Shell via Node.js Descendant"
os_list = ["linux"]
version = "1.0.4"

query = '''
process where event.type == "start" and event.action == "exec" and (
   process.parent.name == "node" or
   descendant of [process where event.type == "start" and event.action == "exec" and process.name == "node"]
 ) and
 (
  (process.name : "python*" and process.args : "-c" and process.args : (
   "*import*pty*spawn*", "*import*subprocess*call*", "*os.system*"
  )) or
  (process.name : "perl*" and process.args : "-e" and process.args : "*socket*" and process.args : (
   "*exec*", "*system*"
  )) or
  (process.name : "ruby*" and process.args : ("-e", "-rsocket") and process.args : (
   "*TCPSocket.new*", "*TCPSocket.open*"
   )) or
  (process.name : "lua*" and process.args : "-e" and process.args : "*socket.tcp*" and process.args : (
   "*io.popen*", "*os.execute*"
  )) or
  (process.name : "php*" and process.args : "-r" and process.args : "*fsockopen*" and process.args : "*/bin/*sh*") or 
  (process.name == "node" and process.args == "-e" and process.args : "*spawn*sh*" and process.args : "*connect*") or
  (process.name : ("awk", "gawk", "mawk", "nawk") and process.args : "*/inet/tcp/*") or
  (process.name in ("socat", "nc", "ncat", "netcat", "nc.openbsd", "nc.traditional") and not process.args like "-*z*")
) and not (
  process.command_line like ("*127.0.0.1*", "*localhost*") or
  process.parent.executable like (
    "/home/*/.local/bin/pip", "/plz-out/bin/cloud/tools/can-toolbox/publish-to-cws/publish-to-testers.sh"
  ) or
  process.parent.command_line like "*/usr/tmp/claude-http-*.sock*"
)
'''

min_endpoint_version = "7.15.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[threat.technique.subtechnique]]
id = "T1059.004"
name = "Unix Shell"
reference = "https://attack.mitre.org/techniques/T1059/004/"



[threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1071"
name = "Application Layer Protocol"
reference = "https://attack.mitre.org/techniques/T1071/"


[threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"

[internal]
min_endpoint_version = "7.15.0"
