[rule]
description = """
Detects the execution of a user discovery command from a shared memory directory. This is highly abnormal behavior and
can be an indication of malicious activity.
"""
id = "c932c9f0-76ed-4d78-a242-cfaade43080c"
license = "Elastic License v2"
name = "User Discovery Command Execution from Shared Memory"
os_list = ["linux"]
version = "1.0.5"

query = '''
process where event.action == "exec" and event.type == "start" and
process.parent.executable : "/dev/shm/*" and
process.name in ("whoami", "id", "hostname", "ps", "ifconfig", "netstat", "df")
'''

min_endpoint_version = "7.15.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[threat.technique.subtechnique]]
id = "T1059.004"
name = "Unix Shell"
reference = "https://attack.mitre.org/techniques/T1059/004/"



[threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1033"
name = "System Owner/User Discovery"
reference = "https://attack.mitre.org/techniques/T1033/"


[threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"

[internal]
min_endpoint_version = "7.15.0"
