[rule]
description = """
This rule detects when a web server downloads a file and uses a redirect in conjunction with a suspicious command line.
Attackers may exploit RCE or file upload vulnerabilities to download malicious files to web servers to gain/maintain
access and to establish a command and control channel.
"""
id = "fa71e336-0177-4732-b58b-53eb4a87a286"
license = "Elastic License v2"
name = "Suspicious Download and Redirect by Web Server"
os_list = ["linux"]
version = "1.0.9"

query = '''
process where event.type == "start" and event.action == "exec" and (
  process.parent.name in (
    "apache", "nginx", "apache2", "httpd", "lighttpd", "caddy", "mongrel_rails", "gunicorn",
    "uwsgi", "openresty", "cherokee", "h2o", "resin", "puma", "unicorn", "traefik", "tornado", "hypercorn",
    "daphne", "twistd", "yaws", "webfsd", "httpd.worker", "flask", "rails", "mongrel", "php-cgi",
    "php-fcgi", "php-cgi.cagefs", "catalina.sh", "hiawatha", "lswsctrl"
  ) or
  process.parent.name like "php-fpm*" or
  user.name in ("apache", "www-data", "httpd", "nginx", "lighttpd", "tomcat", "tomcat8", "tomcat9") or
  user.id in (33, 498, 48) or
  (process.parent.name == "java" and process.parent.working_directory like "/u0?/*") or
  process.parent.working_directory like "/var/www/*"
) and
process.name in ("bash", "dash", "sh", "tcsh", "csh", "zsh", "ksh", "fish") and
process.args == "-c" and process.args : ("wget *", "curl *") and
process.command_line like ("*>*", "*<*") and
process.command_line like (
  "*|*sh *", "*;*", "*/tmp/*", "*/var/tmp/*", "*/dev/shm/*", "*/var/www/*", "*/run/*", "*/var/run/*", "*/home/*",
  "* netcat *", "* ncat *", "*python*", "* php*", "*perl*", "*ruby*", "*echo *", "*/dev/tcp*", "*/dev/udp/*", "*cat *",
  "*import*pty*spawn*", "*import*subprocess*call*", "*TCPSocket.new*", "*TCPSocket.open*", "*io.popen*", "*os.execute*",
  "*fsockopen*", "*disown*", "*/etc/cron*", "*/etc/rc.local*", "*/etc/init.d*", "*/etc/update-motd.d*", "*/etc/ld.so*",
  "*/etc/sudoers*", "*base64 *", "*base32 *", "*/etc/profile*", "*/etc/ssh*", "*/home/*/.ssh/*", "*/root/.ssh*",
  "*~/.ssh/*", "*nohup*", "*xxd *", "*/etc/shadow*", "*chattr *", "* nc *"
) and not (
  process.parent.name in ("cron", "crond") or
  process.parent.args == "/usr/local/bin/d42grep" or
  process.parent.executable like ("/opt/puppetlabs/*", "/root/.cursor-server/*/node", "/home/.cursor-server/*/node") or
  process.command_line : (
    "*nginx*.tar.gz*", "*rubyext-ruby*.tar.gz*", "*Content-Type: application/json*", "*Authorization: Bearer*",
    "sh -c curl* | grep*", """sh -c curl -H "Deliver-To*"""
  ) or
  process.parent.command_line like (
    "/usr/bin/php*command:getSatelliteDatas*", "/usr/bin/php*command:getHailDatas*", "*ansible*"
  ) or
  process.working_directory == "/home/ansible" or
  (process.parent.args like "scripts/generator/*.py" and process.working_directory == "/usr/src/app") or
  (process.parent.name == "java" and process.command_line like "*/home/asterisk/audio/*") or
  (process.parent.name == "node" and process.command_line like~ "/bin/bash -O extglob*") or
  (process.parent.name == "perl" and process.parent.args == "-X") or
  (process.parent.executable == "/usr/bin/perl" and process.working_directory like "/home/*") or
  (process.parent.args == "/cav/gtm/mumps" and process.working_directory == "/cav/gtm")
)
'''

min_endpoint_version = "8.2.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[threat.technique.subtechnique]]
id = "T1059.004"
name = "Unix Shell"
reference = "https://attack.mitre.org/techniques/T1059/004/"



[threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1505"
name = "Server Software Component"
reference = "https://attack.mitre.org/techniques/T1505/"
[[threat.technique.subtechnique]]
id = "T1505.003"
name = "Web Shell"
reference = "https://attack.mitre.org/techniques/T1505/003/"



[threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"
[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1071"
name = "Application Layer Protocol"
reference = "https://attack.mitre.org/techniques/T1071/"


[threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"

[internal]
min_endpoint_version = "8.2.0"
