[rule]
description = """
This rule detects the creation of files in unusual locations by the sudo command. Attackers may use sudo to create files
in unexpected directories as part of privilege escalation or persistence. An example of this is CVE-2022-0847, also
known as "Dirty Pipe", which allows an unprivileged user to overwrite data in read-only files.
"""
id = "5f00dbc7-b999-4798-9bc5-6891e4e6dc84"
license = "Elastic License v2"
name = "Unusual Sudo File Creation"
os_list = ["linux"]
reference = ["https://www.exploit-db.com/exploits/50808"]
version = "1.0.6"

query = '''
sequence by process.entity_id with maxspan=15s
  [process where event.type == "start" and event.action == "exec" and not (
    process.command_line like ("sudo -e /etc/serverd/*.conf", "*sudo via ansible*") or
    process.args == "sudoedit" or
    process.working_directory like "/tmp/newroot/*"
  )]
  [file where event.type == "creation" and process.name == "sudo" and
   file.path like~ ("/home/*", "/tmp/*", "/var/tmp/*", "/dev/shm/*") and
   not (
     file.path like (
      "/tmp/sh-thd.*", "/tmp/krb5cc_*", "/tmp/pam_krb5_tmp_*", "/tmp/ansible_ansible.legacy.*",
      "/tmp/hsperfdata*"
    ) or
    file.name == ".sudo_as_admin_successful"
  )]
'''

min_endpoint_version = "7.15.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 1

[[actions]]
action = "kill_process"
field = "process.parent.entity_id"
state = 0

[[actions]]
action = "kill_process"
field = "process.parent.entity_id"
state = 1

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1068"
name = "Exploitation for Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1068/"


[threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"

[internal]
min_endpoint_version = "7.15.0"
