[rule]
description = """
Identifies access attempts to common credential files by one of the known GenAI utilities. This activity could be the
result of exploiting a prompt injection vulnerability or compromised external dependency.
"""
id = "fb9bfd87-fd86-41e3-ab64-2e6656a929cd"
license = "Elastic License v2"
name = "Suspicious Credential Access via GenAI Tool"
os_list = ["macos", "windows"]
reference = [
    "https://cymulate.com/blog/cve-2025-547954-54795-claude-inverseprompt/",
    "https://specterops.io/blog/2025/11/21/an-evening-with-claude-code/",
]
version = "1.0.1"

query = '''
file where event.action == "open" and

  process.name in ("claude", "claude.exe", "cursor.exe", "cursor", "Cursor Helper", "codex", "codex.exe", "sandbox-exec", "openai", "openai.exe",
                    "ollama.exe", "ollama", "textgen.exe", "textgen", "lmstudio.exe", "lmstudio", "copilot.exe", "copilot", "gemini-cli.exe", "llm") and

  (file.name : ("logins.json", "cookies.sqlite", "Cookies", "Cookies.binarycookies", "signons.sqlite", "cert?.db", "key?.db",
                "Cookies", "History", "Bookmarks", "formhistory.sqlite") or
   file.path :
       ("?:\\Users\\*\\AppData\\Local\\Google\\Chrome\\User Data\\Local State",
        "?:\\Users\\*\\AppData\\Local\\Microsoft\\Edge\\User Data\\Local State",
        "?:\\users\\*\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data",
        "?:\\Users\\*\\AppData\\Local\\Microsoft\\Edge\\User Data\\Default\\Login Data",
        "?:\\users\\*\\AppData\\*\\gcloud\\credentials.db",
        "?:\\users\\*\\AppData\\*\\gcloud\\legacy_credentials",
        "?:\\users\\*\\AppData\\*\\gcloud\\access_tokens.db",
        "?:\\users\\*\\.azure\\accessTokens.json",
        "?:\\users\\*\\.azure\\azureProfile.json",
        "?:\\users\\*\\.aws\\credentials",
        "?:\\Users\\*\\.config\\git\\credentials",
        "/Users/*/Library/Application Support/Google/Chrome/Default/Login Data",
        "/Users/*/Library/Application Support/Microsoft/Edge/Default/Login Data",
        "/Users/*/.aws/credentials",
        "/Users/*/.config/gcloud/credentials.db",
        "/Users/*/.azure/accessTokens.json",
        "/Users/*/.azure/azureProfile.json"))
'''

min_endpoint_version = "8.10.0"
optional_actions = []
[[actions]]
action = "kill_process"
field = "process.entity_id"
state = 0

[[threat]]
framework = "MITRE ATT&CK"
[[threat.technique]]
id = "T1539"
name = "Steal Web Session Cookie"
reference = "https://attack.mitre.org/techniques/T1539/"

[[threat.technique]]
id = "T1552"
name = "Unsecured Credentials"
reference = "https://attack.mitre.org/techniques/T1552/"
[[threat.technique.subtechnique]]
id = "T1552.001"
name = "Credentials In Files"
reference = "https://attack.mitre.org/techniques/T1552/001/"


[[threat.technique]]
id = "T1555"
name = "Credentials from Password Stores"
reference = "https://attack.mitre.org/techniques/T1555/"
[[threat.technique.subtechnique]]
id = "T1555.003"
name = "Credentials from Web Browsers"
reference = "https://attack.mitre.org/techniques/T1555/003/"



[threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

[internal]
min_endpoint_version = "8.10.0"
